tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Application launcher and productivity software
cask "alfred"
# iOS App Store alternative
cask "altserver"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Git client focusing on productivity
cask "gitkraken"
# Free and open-source media player
cask "iina"
# Adaptive brightness for external displays
cask "lunar"
# Desktop virtualization software
cask "parallels"
# Digital design and prototyping platform
cask "sketch"
mas "1Password 7", id: 1333542190
mas "Adobe Lightroom", id: 1451544217
mas "Bear", id: 1091189122
mas "Focus", id: 777233759
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Moom", id: 419330170
mas "PiPifier", id: 1160374471
mas "Reeder", id: 1529448980
mas "Snappy", id: 512617038
mas "SponsorBlock port for YouTube - Skip Sponsorships", id: 1532163541
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Wipr", id: 1320666476
mas "Xcode", id: 497799835
mas "Yubico Authenticator", id: 1497506650
